app/controllers/people_controller.rb

INSERT INTO "comments" ("text") VALUES (?)  [["text", "clearly"]]
---
	def comments
		Comment.create(text: params[:comments])

INSERT INTO "responses" ("would_donate") VALUES (?)  [["would_donate", true]]
---
	def yes
		Response.create(would_donate: true)

INSERT INTO "responses" ("would_donate") VALUES (?)  [["would_donate", false]]
---
	def no
		Response.create(would_donate: false)