app/controllers/signup_controller.rb

INSERT INTO "signups" ("created_at", "email", "updated_at") VALUES (?, ?, ?)  [["created_at", Mon, 18 Feb 2013 02:55:57 UTC +00:00], ["email", nil], ["updated_at", Mon, 18 Feb 2013 02:55:57 UTC +00:00]]
---
	def signup
		if params[:email].blank?
			render text: "this is not valid"
		else
			Signup.create(email: params[:email])